posts/inside-the-cpp-object-model-4/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns#" lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta http-equiv="x-ua-compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>深入探索C++内存模型（4） | Hack Note</title>
<meta name="theme-color" content="#04519b">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="/rss.xml">
<link href="https://cdn.jsdelivr.net/gh/samsonwang/blog@master/assets/css/minima.min.css" rel="stylesheet" type="text/css">
<link rel="canonical" href="https://blog.wangzhl.com/posts/inside-the-cpp-object-model-4/">
<link rel="icon" href="/favicon.ico" sizes="64x64">
<link rel="prev" href="/posts/inside-the-cpp-object-model-3/" title="深入探索C++内存模型（3）" type="text/html">
<link rel="next" href="/posts/redis-fundamental/" title="redis基础" type="text/html">
<meta name="author" content="Samson Wang">
<meta property="og:site_name" content="Hack Note">
<meta property="og:title" content="深入探索C++内存模型（4）">
<meta property="og:url" content="https://blog.wangzhl.com/posts/inside-the-cpp-object-model-4/">
<meta property="og:description" content="第四章是Function语意学，这一章主要介绍类相关函数的底层实现原理，就虚函数进行了展开讨论，通过实际代码的测试结果验证分析结论。对 inline 函数可能会出现的问题进行了分析，对 inline 函数的使用提出了指导意见。





第4章 Function 语意学 （the semantics of function）


4.1 Member 的各种调用方式


Nonstatic Mem">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-04-22T10:27:22+08:00">
<meta property="article:tag" content="cpp">
<meta property="article:tag" content="digest">
<meta property="article:tag" content="Lippman">
<meta property="article:tag" content="memory layout">
<meta property="article:tag" content="object model">
</head>
<body>
  <header class="site-header nav-custom"><div class="wrapper">
      <a class="site-title" rel="author" href="/">Hack Note</a>
      <nav class="site-nav"><input type="checkbox" id="nav-trigger" class="nav-trigger"><label for="nav-trigger">
          <span class="menu-icon">
            <svg viewbox="0 0 18 15" width="18px" height="15px"><use href="/assets/svg/theme.svg#menu-icon"></use></svg></span>
        </label>
        <div class="trigger">
          
            <a class="page-link" href="/">Home</a>
            <a class="page-link" href="/archive/">Archive</a>
            <a class="page-link" href="/tag/">Tag</a>
            <a class="page-link" href="/about/">About</a>

        </div>
      </nav>
</div>
  </header><main class="page-content" aria-label="Content"><div class="wrapper">

    

    
<article class="post h-entry" itemscope="" itemtype="http://schema.org/BlogPosting"><header class="post-header"><h1 class="post-title p-name" itemprop="name headline">深入探索C++内存模型（4）</h1>

    <p class="post-meta">
      
    <time class="dt-published" datetime="2019-04-22T10:27:22+08:00" itemprop="datePublished">Apr 22, 2019</time></p>
  </header><div class="post-content e-content" itemprop="articleBody text">
    <p>
第四章是Function语意学，这一章主要介绍类相关函数的底层实现原理，就虚函数进行了展开讨论，通过实际代码的测试结果验证分析结论。对 inline 函数可能会出现的问题进行了分析，对 inline 函数的使用提出了指导意见。<br></p>

<!-- TEASER_END -->

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">第4章 Function 语意学 （the semantics of function）</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">4.1 Member 的各种调用方式</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Nonstatic Member Functions（非静态成员函数）</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
C++ 的设计准则之一就是：nonstatic member function 至少必须和一版的nonmember function有相同的效率。<br></p>

<p>
编译器会将member function重写成一个外部函数，对函数名称进行“mangling”处理，使它在程序中成为独一无二的语汇。在这过程中也会施行NRV优化。<br></p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">名称的特殊处理（name mangling）</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
一版而言，member的名称前面汇被加上 class 名称，行程独一无二的命名。<br></p>

<p>
对于类中的成员变量也会进行换名，以应对可能在继承关系中引入的同名成员变量。<br></p>

<p>
两个实体如果拥有独一无二的 name mangling，那么任何不正确的调用操作在链接时期就因无法决议（resolved）而失败，有是由我们可以乐观地称此为“确保类型安全的链接行为”（type-safe linkage）。我说“乐观地”是因为它只可以捕捉函数的标记（signature，即函数名称 + 参数数目 + 参数类型）错误，如果“返回类型”声明错误，就没办法检查出来。<br></p>

<p>
当前的编译系统中，有一种所谓的 demangling 工具，用来拦截名称并将其转换回去，使用者仍然可以不关心其内部名称发生的转换。<br></p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">virtual member functions（虚拟成员函数）</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
使用指针调用虚函数会从虚函数表找到对应的虚函数地址，使用该虚函数地址完成函数的调用。<br></p>

<p>
如果使用类域明确地调用虚函数，则会压制由于虚拟机制而产生的不必要的重复查找虚函数表操作。<br></p>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4">static member functions（静态成员函数）</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
静态成员函数的特性：<br></p>
<ol class="org-ol">
<li>没有 this 指针<br>
</li>
<li>不能直接存取其 class 中的 nonstatic members<br>
</li>
<li>不能比声明为 const 、 volatile 或 virtual<br>
</li>
<li>不需要经由 class object 才被调用 （虽然大部分时候它是这样被调用的）<br>
</li>
</ol>
<p>
一个 static member function 当然会被体书于 class 声明之外，并给予一个经过“mangled”的适当名称。<br></p>

<p>
如果取一个 static member function 的地址，获得的是其在内存中的位置，也就其地址。由于 static member function 没有 this 指针，所以其地址的类型并不是一个 “指向 class member function 的指针”，而是一个 “nonmember function 的指针”。也就是说：<br></p>
<div class="highlight"><pre><span></span><span class="o">&amp;</span><span class="n">Point3d</span><span class="o">::</span><span class="n">object_count</span><span class="p">();</span>
</pre></div>
<p>
会得到一个数值，类型是：<br></p>
<div class="highlight"><pre><span></span><span class="kt">unsigned</span> <span class="nf">int</span> <span class="p">(</span><span class="o">*</span><span class="p">)();</span>
</pre></div>
<p>
而不是：<br></p>
<div class="highlight"><pre><span></span><span class="kt">unsigned</span> <span class="nf">int</span> <span class="p">(</span><span class="n">Point3d</span><span class="o">::*</span><span class="p">)();</span>
</pre></div>

<p>
static member function 由于缺乏 this 指针，因此差不多等同于 nonmember function。它提供了一个意想不到的好处：成为一个 callback 函数，也可以应用在线程（thread）函数上。<br></p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">4.2 virtual member function (虚拟成员函数)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
为了支持 virtual function 机制，必须首先能够对于多态对象有某种形式的“执行期判断法（runtime type resolution）”。在添加这些特性时，必定会增加类空间的负担，还需要考虑到对C语言的兼容性。<br></p>

<p>
在C++中，多态（polymorphism）表示“以一个public base class 的指针（或reference），寻址出一个 derived class object”的意思。<br></p>

<p>
指针的多态机能主要扮演一个输送机制（transport mechanism）的角色，我们可以通过它在程序的任何地方采用一组 public derived 类型。这种多态形式被称为是消极的，可以在编译时期完成。当被指出的对象真正被使用时，多态也就编程积极的（active）了。<br></p>

<p>
在runtime type identification （RTTI）性质于1993年被引入 C++ 语言之前， C++ 对“积极多态（active polymorphism）”的唯一支持，就是对于 virtual function call 的决议（resolution）操作。有了RTTI，就能够在执行期查询一个多态的 pointer 或多态的 reference 了。<br></p>

<p>
欲鉴定哪些 class 展现多态特性，我们需要额外的执行期信息。适当的方法就是看看啊它是否有任何 virtual function，只要 class 拥有一个 virtual function，它就需要这份额外的执行期信息。<br></p>

<p>
在 C++ 中， virtual functions可以在编译时期获知，这一组地址是固定不变的，执行期不可能新增或替换之。在程序执行时，表格的大小和内容都不会改变，多亿其构建和存取皆可以由编译器完全掌握，不需要执行期的任何介入。<br></p>

<p>
一个 class 只会有一个 virtual table，没一个 table 内含其对应的 class object 中所有 active virtual functions 函数实体的地址。这些 active virtual functions 包括：<br></p>
<ol class="org-ol">
<li>这个 class 所定义的函数实体，它会改写（overriding）一个可能存在的 base class virtual function 函数实体。<br>
</li>
<li>继承自 base class 的函数实体，这是在 derived class 决定不改写 virtual function 时才会出现的情况。<br>
</li>
<li>一个 pure<sub>virtual</sub><sub>called</sub>() 函数实体，它既可以扮演 pure virtual function 的空间保卫者角色，也可以当作执行期异常处理函数。<br>
</li>
</ol>
<p>
每一个 virtual function 都被指派一个固定的索引值，这个索引在整个继承体系中保持与特定的 virtual function 的关联。<br></p>

<p>
对于虚函数表在派生过程中的修改和拓展，在书中有很多详尽的代码示例可供参考。<br></p>

<p>
如何在编译时期设定 virtual function 的调用：<br></p>
<ol class="org-ol">
<li>我们并不知道 <code>ptr</code> 所指内向的真正类型，然而我知道，经由 ptr 可以存取到该对象的 virtual table。<br>
</li>
<li>虽然我不知道那个 <code>z()</code> 函数实体会被调用，但我知道每一个 <code>z()</code> 函数地址都被放在指定位置（slot4）。<br>
</li>
</ol>
<p>
这些信息使得编译器可以将该调用转化为：<br></p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="o">*</span><span class="n">ptr</span><span class="o">-&gt;</span><span class="n">vptr</span><span class="p">[</span><span class="mi">4</span><span class="p">])(</span><span class="n">ptr</span><span class="p">);</span>
</pre></div>

<p>
在一个单一继承体系中，virtual function 机制的行为十分良好，不但有效而且很容易塑造出模型来，但是在多重继承和虚拟继承之中，对 virtual functions 的支持就没有那么美好了。<br></p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">多重继承下的 virtual functions</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
在多重继承中支持 virtual functions，其复杂度围绕在第二个及后继的 base class 身上，以及“必须在执行期调整 this 指针”这一点。<br></p>

<p>
对于 derived class 的必要的 this 指针调整操作，必须在执行期完成。即 offset 的大小，以及把 offset 加到 this 指针上头的那一小段程序代码，必须有编译器在某个地方插入。<br></p>

<p>
比较有效率的解决方法是利用所谓的 thunk (thunk 是 knuth 博士的倒拼字）。所谓 thunk 是一小段 assembly 码，用来（1）以适当的 offset 值调整 this 指针，（2）跳到 virtual function 去。<br></p>

<p>
Thunk 技术允许 virtual table slot 继续内含一个简单的指针，因此多重继承不需要任何空间上的额外负担。 slots 中的地址可以直接指向 virtual function，也可以指向一个相关的 thunk（如果需要调整 this 指针的话）。于是，对于那些不需要调整 this 指针的 virtual function，也就不需要承担效率上的额外负担。<br></p>

<p>
调整 this 指针的第二个额外负担就是，由于两种不同的可能：（1）经由 derived class （或第一个 base class）调用，（2）经由第二个（或其后继） base class 调用，同一函数在 virtual table 中可能需要多个对应的 slosts。例如：<br></p>
<div class="highlight"><pre><span></span><span class="n">Base</span><span class="o">*</span> <span class="n">pbase1</span> <span class="o">=</span> <span class="k">new</span> <span class="n">Derived</span><span class="p">;</span>
<span class="n">Base</span><span class="o">*</span> <span class="n">pbase2</span> <span class="o">=</span> <span class="k">new</span> <span class="n">Derived</span><span class="p">;</span>

<span class="k">delete</span> <span class="n">pbase1</span><span class="p">;</span>
<span class="k">delete</span> <span class="n">pbase2</span><span class="p">;</span>
</pre></div>
<p>
虽然两个 delete 操作导致相同的 derived destructor，但它们需要两个不同的 virtual table slots：<br></p>
<ol class="org-ol">
<li>
<code>pbase1</code> 不需要调整 this 指针（因为 Base1 是最左端 base class，它已经指向 Derived 对象的起始处），其 virtual table slot 需放置真正的 destructor 地址。<br>
</li>
<li>
<code>pbase2</code> 需要调整 this 指针，其 virtual table slot 需要相关的 thunk 地址。<br>
</li>
</ol>
<p>
在多重继承下， 一个 derived class 内含 n-1 个额外的 virtual tables， n 表示其上一层 base class 的数目。因此，单一继承将不会有额外的 virtual table。<br></p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">虚继承下的 virtual function</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
在虚拟继承中，也需要调整 this 指针，至于在虚拟继承的情况下要消除 thunks，一般而言已经被证明是一项高难度技术。<br></p>

<p>
当一个 virtual base class 从另一个 virtual base class 派生而来，并且两者都支持 virtual function 和 nonstatic data member 时， 编译器对于 virtual base class 的支持简直就像进了迷宫一行。<br></p>

<p>
作者的建议是，不要在一个 virtual base class 中声明 nonstatic data members。<br></p>
</div>
</div>
</div>
