posts/inside-the-cpp-object-model-4.org
*** 4.3 函数的效能
本章节主要针对前文中分析的各种函数调用情况，编写代码进行测试，并对实验结果进行了分析。

按照前文的分析，nonmember 或 static member 或 nonstatic member 函数都被转化为完全相同的形式，所以从结果中能看到三者的效率完全相同。

对于 inline 函数，未优化的情况提高了 25% 左右的效率，而其优化版本的表现提升十分明显。这归功于编译器将“被视为不变的表达式（expressions）”提到循环之外，因此只计算一次。此例显示，inline函数不仅能够节省一般函数调用所带来的额外负担，也提供了程序优化的额外机会。

虚函数的执行效率降低了 4% 到 11% 不等，这是由虚拟机制产生的。


*** 4.4 指向 member function 的指针 （pointer to member functions）
由前文的论述中可以得知，取一个 nonstatic data member 的地址，得到的结果是该 member 在 class 布局中的 byte 位置（再加1）.可以想象它是一个不完整的值，需要被绑定于某个 class object 的地址上，才能够被存取。

取一个 nonstatic member function 的地址，如果该函数是 nonvirtual，则得到的结果是它在内存中的真正地址。然而这个值也是不完全的，它也需要被绑定于某个 class object 的地址上，才能够通过它调用该函数。所有的 nonstatic member function 都需要对象的地址（以参数 this 指出）。

使用一个 “member function 指针”，如果并不用于 virtual function、多重继承、virtual base class 等情况的话，并不会比使用一个“nonmember function 指针”的成本更高，编译器可以为它们提供相同的效率。


**** 支持“指向 virtual member function”的指针
注意下面的程序片段：
#+BEGIN_SRC cpp
float (Point::*pmf)() = &Point::z;
Point* ptr = new Point3d;
#+END_SRC
=pmf= , 一个指向 member function 的指针，被设置为 Point::z() (一个 virtual function) 的地址，ptr 则被指定以一个 Point3d 对象，如果直接由 =ptr= 调用 =z()= :
#+BEGIN_SRC cpp
ptr->z();
#+END_SRC
则被调用的是 Point3d::z()，但如果我们从 =pmf= 间接调用 =z()= 呢？
#+BEGIN_SRC cpp
(ptr->*pmf)();
#+END_SRC
仍然是 Point3d::z() 被调用吗？答案是 yes，也就是说，虚拟机制仍然能够在使用“指向 member function 的指针”的情况下运行。

结合前面章节，对一个 nonstatic member function 取其地址，将获得该函数在内存中的地址，然而对一个 virtual function，其地址在编译时期时候未知的，所能知道的近视 virtual function 在其相关 virtual table 中的索引值。也就是说，对一个 virtual member function 取其地址，所能获得的只是一个索引值。

通过 =pmf= 来调用 =z()= 会被内部转化为一个编译时期的式子，一般形式如下：
#+BEGIN_SRC cpp
(*ptr->vptr[(int)pmf])(ptr);
#+END_SRC

**** 多重继承下，指向 member function 的指针
为了让指向 member function 的指针也能够支持多重继承和虚拟继承，Stroustrup设计了下面一个结构体：
#+BEGIN_SRC cpp
struct __mptr {
    int delta;
    int index;
    union {
        ptrtofunc faddr;
        int v_offset;
    };
};
#+END_SRC

=index= 和 =faddr= 分别（不同时）带有 virtual table 索引和 nonvirtual member function 地址。为了方便，当 index 不指向 virtual table 时，会被设置为 -1。

在该模型之下，像这样的调用操作：
#+BEGIN_SRC cpp
(ptr->*pmf)();
#+END_SRC
会变成：
#+BEGIN_SRC cpp
(pmf.index < 0)
  ? // non-virtual invocation
  (*pmf.faddr)(ptr)
  : // virtual invocation
  (* ptr->vptr[pmf.index] (ptr));
#+END_SRC

这种方法的缺点是：
1. 每一个调用操作都得付出上述成本，检查其是否为 virtual 或 nonvirtual；
2. 当传递一个不变值的指针给 member function 时，它需要产生一个临时性对象。

**** “指向 member function 的指针”的效率
本节测试了函数经由一以方式调用的效率：
1. 指向 nonmember function 的指针；
2. 指向 class member function 的指针；
3. 指向 virtual member function 的指针；
4. 多重继承下的 nonvirtual 及 virtual member function 调用；
5. 虚拟继承下的 nonvirtual 及 virtual member function 调用。


*** 4.5 inline functions
处理一个 inline 函数，有两个阶段：
1. 分析函数定义，以决定函数的“intrinsic inline ability”（本质的 inline 能力）。“intrinsic”（本质的、固有的）在这里意指“与编译器相关”。如果函数因其复杂度，或因其构建问题，被判断不可成为inline，它会被转为一个 static 函数，并在“被编译模块”内产生对应的函数定义。
2. 真正的 inline 函数拓展操作是在调用的那一点上，这回带来参数的求值操作（evaluation）以及临时性对象的管理。同样是在拓展点上，编译器将决定这个调用是否“不可为inline”。

大部分编译器厂商（UNIX和PC都有）似乎认为不值得在 inline 支持技术上做详细的讨论，通常你必须进入到汇编器（assembler）中才能看到是否真的实现了 inline。

**** 形式参数（formal argument）
在 inline 拓展期间，每一个形式参数都会被对应的实际参数取代。其副作用为，不可以只是简单地塞入程序中出现的每一个形式参数，因为这将导致对于时间参数的多次求值操作（evaluation）。

一般而言，面对“会带来副作用的实际参数”，通常都需要引入临时性对象。换句话说，如果实际参数十一个常量表达式（constant expression），我们可以在替换之间先完成其求值操作（evalutaion）；后继的 inline 替换，就可以把常量直接“绑”上去，如果既不是个常量表达式，也不是个带有副作用的表达式，那么就直接代换之。

示例代码如下：
#+BEGIN_SRC cpp
inline int min (int i, int j) {
    return i < j ? i : j;
}
// 调用操作
inline int bar() {
    int minval;
    int val1 = 1024;
    int val2 = 2048;
    /*(1)*/ minval = min(val1, val2);
    /*(2)*/ minval = min(1024, 2048);
    /*(3)*/ minval = min(foo(), bar() + 1);
    return minval;
}
#+END_SRC

分析如下：
标记为（1）的那一行会被拓展为：
#+BEGIN_SRC cpp
// 参数直接代换
minval = val1 < val2 ? val1 : val2;
#+END_SRC

标记为（2）的那一行直接拥抱常量：
#+BEGIN_SRC cpp
// 代换之后，直接使用常量
minval = 1024;
#+END_SRC

标记为（3）的那一行则引发参数的副作用，它需要引入一个临时对象，以避免重复求值（multiple evaluation）：
#+BEGIN_SRC cpp
// 有副作用，所以导入临时对象
int t1;
int t2;
minval = (t1 = foo()), (t2 = bar() + 1), t1 < t2 ? t1 : t2;
#+END_SRC

