posts/inside-the-cpp-object-model-4/index.html


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">4.3 函数的效能</h3>
<div class="outline-text-3" id="text-1-3">
<p>
本章节主要针对前文中分析的各种函数调用情况，编写代码进行测试，并对实验结果进行了分析。<br></p>

<p>
按照前文的分析，nonmember 或 static member 或 nonstatic member 函数都被转化为完全相同的形式，所以从结果中能看到三者的效率完全相同。<br></p>

<p>
对于 inline 函数，未优化的情况提高了 25% 左右的效率，而其优化版本的表现提升十分明显。这归功于编译器将“被视为不变的表达式（expressions）”提到循环之外，因此只计算一次。此例显示，inline函数不仅能够节省一般函数调用所带来的额外负担，也提供了程序优化的额外机会。<br></p>

<p>
虚函数的执行效率降低了 4% 到 11% 不等，这是由虚拟机制产生的。<br></p>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">4.4 指向 member function 的指针 （pointer to member functions）</h3>
<div class="outline-text-3" id="text-1-4">
<p>
由前文的论述中可以得知，取一个 nonstatic data member 的地址，得到的结果是该 member 在 class 布局中的 byte 位置（再加1）.可以想象它是一个不完整的值，需要被绑定于某个 class object 的地址上，才能够被存取。<br></p>

<p>
取一个 nonstatic member function 的地址，如果该函数是 nonvirtual，则得到的结果是它在内存中的真正地址。然而这个值也是不完全的，它也需要被绑定于某个 class object 的地址上，才能够通过它调用该函数。所有的 nonstatic member function 都需要对象的地址（以参数 this 指出）。<br></p>

<p>
使用一个 “member function 指针”，如果并不用于 virtual function、多重继承、virtual base class 等情况的话，并不会比使用一个“nonmember function 指针”的成本更高，编译器可以为它们提供相同的效率。<br></p>
</div>


<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">支持“指向 virtual member function”的指针</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
注意下面的程序片段：<br></p>
<div class="highlight"><pre><span></span><span class="kt">float</span> <span class="p">(</span><span class="n">Point</span><span class="o">::*</span><span class="n">pmf</span><span class="p">)()</span> <span class="o">=</span> <span class="o">&amp;</span><span class="n">Point</span><span class="o">::</span><span class="n">z</span><span class="p">;</span>
<span class="n">Point</span><span class="o">*</span> <span class="n">ptr</span> <span class="o">=</span> <span class="k">new</span> <span class="n">Point3d</span><span class="p">;</span>
</pre></div>
<p>
<code>pmf</code> , 一个指向 member function 的指针，被设置为 Point::z() (一个 virtual function) 的地址，ptr 则被指定以一个 Point3d 对象，如果直接由 <code>ptr</code> 调用 <code>z()</code> :<br></p>
<div class="highlight"><pre><span></span><span class="n">ptr</span><span class="o">-&gt;</span><span class="n">z</span><span class="p">();</span>
</pre></div>
<p>
则被调用的是 Point3d::z()，但如果我们从 <code>pmf</code> 间接调用 <code>z()</code> 呢？<br></p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="n">ptr</span><span class="o">-&gt;*</span><span class="n">pmf</span><span class="p">)();</span>
</pre></div>
<p>
仍然是 Point3d::z() 被调用吗？答案是 yes，也就是说，虚拟机制仍然能够在使用“指向 member function 的指针”的情况下运行。<br></p>

<p>
结合前面章节，对一个 nonstatic member function 取其地址，将获得该函数在内存中的地址，然而对一个 virtual function，其地址在编译时期时候未知的，所能知道的近视 virtual function 在其相关 virtual table 中的索引值。也就是说，对一个 virtual member function 取其地址，所能获得的只是一个索引值。<br></p>

<p>
通过 <code>pmf</code> 来调用 <code>z()</code> 会被内部转化为一个编译时期的式子，一般形式如下：<br></p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="o">*</span><span class="n">ptr</span><span class="o">-&gt;</span><span class="n">vptr</span><span class="p">[(</span><span class="kt">int</span><span class="p">)</span><span class="n">pmf</span><span class="p">])(</span><span class="n">ptr</span><span class="p">);</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">多重继承下，指向 member function 的指针</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
为了让指向 member function 的指针也能够支持多重继承和虚拟继承，Stroustrup设计了下面一个结构体：<br></p>
<div class="highlight"><pre><span></span><span class="k">struct</span> <span class="n">__mptr</span> <span class="p">{</span>
    <span class="kt">int</span> <span class="n">delta</span><span class="p">;</span>
    <span class="kt">int</span> <span class="n">index</span><span class="p">;</span>
    <span class="k">union</span> <span class="p">{</span>
	<span class="n">ptrtofunc</span> <span class="n">faddr</span><span class="p">;</span>
	<span class="kt">int</span> <span class="n">v_offset</span><span class="p">;</span>
    <span class="p">};</span>
<span class="p">};</span>
</pre></div>

<p>
<code>index</code> 和 <code>faddr</code> 分别（不同时）带有 virtual table 索引和 nonvirtual member function 地址。为了方便，当 index 不指向 virtual table 时，会被设置为 -1。<br></p>

<p>
在该模型之下，像这样的调用操作：<br></p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="n">ptr</span><span class="o">-&gt;*</span><span class="n">pmf</span><span class="p">)();</span>
</pre></div>
<p>
会变成：<br></p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="n">pmf</span><span class="p">.</span><span class="n">index</span> <span class="o">&lt;</span> <span class="mi">0</span><span class="p">)</span>
  <span class="o">?</span> <span class="c1">// non-virtual invocation</span>
  <span class="p">(</span><span class="o">*</span><span class="n">pmf</span><span class="p">.</span><span class="n">faddr</span><span class="p">)(</span><span class="n">ptr</span><span class="p">)</span>
  <span class="o">:</span> <span class="c1">// virtual invocation</span>
  <span class="p">(</span><span class="o">*</span> <span class="n">ptr</span><span class="o">-&gt;</span><span class="n">vptr</span><span class="p">[</span><span class="n">pmf</span><span class="p">.</span><span class="n">index</span><span class="p">]</span> <span class="p">(</span><span class="n">ptr</span><span class="p">));</span>
</pre></div>

<p>
这种方法的缺点是：<br></p>
<ol class="org-ol">
<li>每一个调用操作都得付出上述成本，检查其是否为 virtual 或 nonvirtual；<br>
</li>
<li>当传递一个不变值的指针给 member function 时，它需要产生一个临时性对象。<br>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">“指向 member function 的指针”的效率</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
本节测试了函数经由一以方式调用的效率：<br></p>
<ol class="org-ol">
<li>指向 nonmember function 的指针；<br>
</li>
<li>指向 class member function 的指针；<br>
</li>
<li>指向 virtual member function 的指针；<br>
</li>
<li>多重继承下的 nonvirtual 及 virtual member function 调用；<br>
</li>
<li>虚拟继承下的 nonvirtual 及 virtual member function 调用。<br>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">4.5 inline functions</h3>
<div class="outline-text-3" id="text-1-5">
<p>
处理一个 inline 函数，有两个阶段：<br></p>
<ol class="org-ol">
<li>分析函数定义，以决定函数的“intrinsic inline ability”（本质的 inline 能力）。“intrinsic”（本质的、固有的）在这里意指“与编译器相关”。如果函数因其复杂度，或因其构建问题，被判断不可成为inline，它会被转为一个 static 函数，并在“被编译模块”内产生对应的函数定义。<br>
</li>
<li>真正的 inline 函数拓展操作是在调用的那一点上，这回带来参数的求值操作（evaluation）以及临时性对象的管理。同样是在拓展点上，编译器将决定这个调用是否“不可为inline”。<br>
</li>
</ol>
<p>
大部分编译器厂商（UNIX和PC都有）似乎认为不值得在 inline 支持技术上做详细的讨论，通常你必须进入到汇编器（assembler）中才能看到是否真的实现了 inline。<br></p>
</div>

<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">形式参数（formal argument）</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
在 inline 拓展期间，每一个形式参数都会被对应的实际参数取代。其副作用为，不可以只是简单地塞入程序中出现的每一个形式参数，因为这将导致对于时间参数的多次求值操作（evaluation）。<br></p>

<p>
一般而言，面对“会带来副作用的实际参数”，通常都需要引入临时性对象。换句话说，如果实际参数十一个常量表达式（constant expression），我们可以在替换之间先完成其求值操作（evalutaion）；后继的 inline 替换，就可以把常量直接“绑”上去，如果既不是个常量表达式，也不是个带有副作用的表达式，那么就直接代换之。<br></p>

<p>
示例代码如下：<br></p>
<div class="highlight"><pre><span></span><span class="kr">inline</span> <span class="kt">int</span> <span class="nf">min</span> <span class="p">(</span><span class="kt">int</span> <span class="n">i</span><span class="p">,</span> <span class="kt">int</span> <span class="n">j</span><span class="p">)</span> <span class="p">{</span>
    <span class="k">return</span> <span class="n">i</span> <span class="o">&lt;</span> <span class="n">j</span> <span class="o">?</span> <span class="nl">i</span> <span class="p">:</span> <span class="n">j</span><span class="p">;</span>
<span class="p">}</span>
<span class="c1">// 调用操作</span>
<span class="kr">inline</span> <span class="kt">int</span> <span class="nf">bar</span><span class="p">()</span> <span class="p">{</span>
    <span class="kt">int</span> <span class="n">minval</span><span class="p">;</span>
    <span class="kt">int</span> <span class="n">val1</span> <span class="o">=</span> <span class="mi">1024</span><span class="p">;</span>
    <span class="kt">int</span> <span class="n">val2</span> <span class="o">=</span> <span class="mi">2048</span><span class="p">;</span>
    <span class="cm">/*(1)*/</span> <span class="n">minval</span> <span class="o">=</span> <span class="n">min</span><span class="p">(</span><span class="n">val1</span><span class="p">,</span> <span class="n">val2</span><span class="p">);</span>
    <span class="cm">/*(2)*/</span> <span class="n">minval</span> <span class="o">=</span> <span class="n">min</span><span class="p">(</span><span class="mi">1024</span><span class="p">,</span> <span class="mi">2048</span><span class="p">);</span>
    <span class="cm">/*(3)*/</span> <span class="n">minval</span> <span class="o">=</span> <span class="n">min</span><span class="p">(</span><span class="n">foo</span><span class="p">(),</span> <span class="n">bar</span><span class="p">()</span> <span class="o">+</span> <span class="mi">1</span><span class="p">);</span>
    <span class="k">return</span> <span class="n">minval</span><span class="p">;</span>
<span class="p">}</span>
</pre></div>

<p>
分析如下：<br>
标记为（1）的那一行会被拓展为：<br></p>
<div class="highlight"><pre><span></span><span class="c1">// 参数直接代换</span>
<span class="n">minval</span> <span class="o">=</span> <span class="n">val1</span> <span class="o">&lt;</span> <span class="n">val2</span> <span class="o">?</span> <span class="nl">val1</span> <span class="p">:</span> <span class="n">val2</span><span class="p">;</span>
</pre></div>

<p>
标记为（2）的那一行直接拥抱常量：<br></p>
<div class="highlight"><pre><span></span><span class="c1">// 代换之后，直接使用常量</span>
<span class="n">minval</span> <span class="o">=</span> <span class="mi">1024</span><span class="p">;</span>
</pre></div>

<p>
标记为（3）的那一行则引发参数的副作用，它需要引入一个临时对象，以避免重复求值（multiple evaluation）：<br></p>
<div class="highlight"><pre><span></span><span class="c1">// 有副作用，所以导入临时对象</span>
<span class="kt">int</span> <span class="n">t1</span><span class="p">;</span>
<span class="kt">int</span> <span class="n">t2</span><span class="p">;</span>
<span class="n">minval</span> <span class="o">=</span> <span class="p">(</span><span class="n">t1</span> <span class="o">=</span> <span class="n">foo</span><span class="p">()),</span> <span class="p">(</span><span class="n">t2</span> <span class="o">=</span> <span class="n">bar</span><span class="p">()</span> <span class="o">+</span> <span class="mi">1</span><span class="p">),</span> <span class="n">t1</span> <span class="o">&lt;</span> <span class="n">t2</span> <span class="o">?</span> <span class="nl">t1</span> <span class="p">:</span> <span class="n">t2</span><span class="p">;</span>
</pre></div>
</div>
</div>
